OrganizationalEvents/app/controllers/api/v1/organizations_controller.rb

      def index
        @Organization = Organization.order('created_at DESC');
---
SELECT `organizations`.* FROM `organizations` ORDER BY created_at DESC

      def show
        @Organization = Organization.find_by_orgname('ILLUMINA');
---
SELECT  `organizations`.* FROM `organizations` WHERE `organizations`.`orgname` = 'ILLUMINA' LIMIT 1

      def create
      @Organization = Organization.new(organization_params)
      if @Organization.save
---
INSERT INTO `organizations` (`orgname`, `country`, `state`, `city`, `street`, `created_at`, `updated_at`) VALUES ('Nutanix', 'US', 'CA', 'San Jose', 'Technology drive', '2019-03-22 04:17:33', '2019-03-22 04:17:33')